In [151]:
import os
os.getcwd()
os.chdir(r'D:\Python Training\ML\Dataset') # r - raw
os.getcwd()

'D:\\Python Training\\ML\\Dataset'

In [11]:
filelist = os.listdir()
filelist
for filename in filelist:
    x = filename.endswith('.csv')
    y = filename.startswith('bos')
    print(filename,x,y)

In [40]:
f = open('mtcars.csv','r')
filecontent1 = f.read() # Read the entire file into 1 huge string
filecontent2 = f.read() # Will try to read the entire file into 1 huge string 
                        #- but nothing to read as pointer is already at end
f.close()

In [30]:
f = open('mtcars.csv','r')
filecontent1 = f.readline() # Read 1 line
filecontent2 = f.readline() # Read next line
filecontent3 = f.readline() # Read next line
#......
f.close()

In [38]:
f = open('mtcars.csv','r')
for line in f:
    # print all Mazda Car Details
    if (line.startswith('Maz')):
        print(line)
    
f.close()

Mazda RX4,21,6,160,110,3.9,2.62,16.46,0,1,4,4

Mazda RX4 Wag,21,6,160,110,3.9,2.875,17.02,0,1,4,4

In [73]:
f = open('mtcars.csv','r')
fout = open('hpgreater200.csv','w')

for line in f:
    #print(type(line),line)
    recordlist = line.split(',')
    print(type(recordlist),recordlist,"--hp----",recordlist[4])
    
    if (recordlist[4]=='hp'):   # This is a header, simply write it
        outline = ','.join(recordlist)
        fout.write(outline)
    else:     # Not a header, check the value > 200 before writing it
        if (int(recordlist[4]) > 200):
            outline = ','.join(recordlist)
            fout.write(outline)

f.close()
fout.close()

<class 'list'> ['CarName', 'mpg', 'cyl', 'disp', 'hp', 'drat', 'wt', 'qsec', 'vs', 'am', 'gear', 'carb\n'] --hp---- hp
<class 'list'> ['Mazda RX4', '21', '6', '160', '110', '3.9', '2.62', '16.46', '0', '1', '4', '4\n'] --hp---- 110
<class 'list'> ['Mazda RX4 Wag', '21', '6', '160', '110', '3.9', '2.875', '17.02', '0', '1', '4', '4\n'] --hp---- 110
<class 'list'> ['Datsun 710', '22.8', '4', '108', '93', '3.85', '2.32', '18.61', '1', '1', '4', '1\n'] --hp---- 93
<class 'list'> ['Hornet 4 Drive', '21.4', '6', '258', '110', '3.08', '3.215', '19.44', '1', '0', '3', '1\n'] --hp---- 110
<class 'list'> ['Hornet Sportabout', '18.7', '8', '360', '175', '3.15', '3.44', '17.02', '0', '0', '3', '2\n'] --hp---- 175
<class 'list'> ['Valiant', '18.1', '6', '225', '105', '2.76', '3.46', '20.22', '1', '0', '3', '1\n'] --hp---- 105
<class 'list'> ['Duster 360', '14.3', '8', '360', '245', '3.21', '3.57', '15.84', '0', '0', '3', '4\n'] --hp---- 245
<class 'list'> ['Merc 240D', '24.4', '4', '146.7', '62', '3.69', '3.19', '20', '1', '0', '4', '2\n'] --hp---- 62
<class 'list'> ['Merc 230', '22.8', '4', '140.8', '95', '3.92', '3.15', '22.9', '1', '0', '4', '2\n'] --hp---- 95
<class 'list'> ['Merc 280', '19.2', '6', '167.6', '123', '3.92', '3.44', '18.3', '1', '0', '4', '4\n'] --hp---- 123
<class 'list'> ['Merc 280C', '17.8', '6', '167.6', '123', '3.92', '3.44', '18.9', '1', '0', '4', '4\n'] --hp---- 123
<class 'list'> ['Merc 450SE', '16.4', '8', '275.8', '180', '3.07', '4.07', '17.4', '0', '0', '3', '3\n'] --hp---- 180
<class 'list'> ['Merc 450SL', '17.3', '8', '275.8', '180', '3.07', '3.73', '17.6', '0', '0', '3', '3\n'] --hp---- 180
<class 'list'> ['Merc 450SLC', '15.2', '8', '275.8', '180', '3.07', '3.78', '18', '0', '0', '3', '3\n'] --hp---- 180
<class 'list'> ['Cadillac Fleetwood', '10.4', '8', '472', '205', '2.93', '5.25', '17.98', '0', '0', '3', '4\n'] --hp---- 205
<class 'list'> ['Lincoln Continental', '10.4', '8', '460', '215', '3', '5.424', '17.82', '0', '0', '3', '4\n'] --hp---- 215
<class 'list'> ['Chrysler Imperial', '14.7', '8', '440', '230', '3.23', '5.345', '17.42', '0', '0', '3', '4\n'] --hp---- 230
<class 'list'> ['Fiat 128', '32.4', '4', '78.7', '66', '4.08', '2.2', '19.47', '1', '1', '4', '1\n'] --hp---- 66
<class 'list'> ['Honda Civic', '30.4', '4', '75.7', '52', '4.93', '1.615', '18.52', '1', '1', '4', '2\n'] --hp---- 52
<class 'list'> ['Toyota Corolla', '33.9', '4', '71.1', '65', '4.22', '1.835', '19.9', '1', '1', '4', '1\n'] --hp---- 65
<class 'list'> ['Toyota Corona', '21.5', '4', '120.1', '97', '3.7', '2.465', '20.01', '1', '0', '3', '1\n'] --hp---- 97
<class 'list'> ['Dodge Challenger', '15.5', '8', '318', '150', '2.76', '3.52', '16.87', '0', '0', '3', '2\n'] --hp---- 150
<class 'list'> ['AMC Javelin', '15.2', '8', '304', '150', '3.15', '3.435', '17.3', '0', '0', '3', '2\n'] --hp---- 150
<class 'list'> ['Camaro Z28', '13.3', '8', '350', '245', '3.73', '3.84', '15.41', '0', '0', '3', '4\n'] --hp---- 245
<class 'list'> ['Pontiac Firebird', '19.2', '8', '400', '175', '3.08', '3.845', '17.05', '0', '0', '3', '2\n'] --hp---- 175
<class 'list'> ['Fiat X1-9', '27.3', '4', '79', '66', '4.08', '1.935', '18.9', '1', '1', '4', '1\n'] --hp---- 66
<class 'list'> ['Porsche 914-2', '26', '4', '120.3', '91', '4.43', '2.14', '16.7', '0', '1', '5', '2\n'] --hp---- 91
<class 'list'> ['Lotus Europa', '30.4', '4', '95.1', '113', '3.77', '1.513', '16.9', '1', '1', '5', '2\n'] --hp---- 113
<class 'list'> ['Ford Pantera L', '15.8', '8', '351', '264', '4.22', '3.17', '14.5', '0', '1', '5', '4\n'] --hp---- 264
<class 'list'> ['Ferrari Dino', '19.7', '6', '145', '175', '3.62', '2.77', '15.5', '0', '1', '5', '6\n'] --hp---- 175
<class 'list'> ['Maserati Bora', '15', '8', '301', '335', '3.54', '3.57', '14.6', '0', '1', '5', '8\n'] --hp---- 335
<class 'list'> ['Volvo 142E', '21.4', '4', '121', '109', '4.11', '2.78', '18.6', '1', '1', '4', '2\n'] --hp---- 109

In [78]:
fout = open('outputmtcars.csv','w')

data = ['This is my first line','This is my second line']

for line in data:
    print(line)
    fout.write(line+'\n')

fout.close()

This is my first line
This is my second line

In [57]:
x = "mtcars,abc,def,ghi"
print(x)
y = x.split(',')
print(y)
print ( ','.join(y)     )

mtcars,abc,def,ghi
['mtcars', 'abc', 'def', 'ghi']
mtcars,abc,def,ghi

In [72]:
x = '123'
print(x)
y = int(x)
print(x,type(x),y, type(y))

123
123 <class 'str'> 123 <class 'int'>

In [79]:
import pandas as pd

In [ ]:
##### pip install pandas

In [89]:
infile = pd.read_csv('mtcars.csv')
print( type(infile) )
# indexes - row header
# columns - col header

<class 'pandas.core.frame.DataFrame'>

In [90]:
infile.head(1)

     CarName   mpg  cyl   disp   hp  drat    wt   qsec  vs  am  gear  carb
0  Mazda RX4  21.0    6  160.0  110   3.9  2.62  16.46   0   1     4     4

In [91]:
infile.tail(1)

       CarName   mpg  cyl   disp   hp  drat    wt  qsec  vs  am  gear  carb
31  Volvo 142E  21.4    4  121.0  109  4.11  2.78  18.6   1   1     4     2

In [87]:
infile.shape # shape is a property or a variable and not a method  - notice () is missing

(32, 12)

In [92]:
infile.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32 entries, 0 to 31
Data columns (total 12 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   CarName  32 non-null     object
 1   mpg      32 non-null     float64
 2   cyl      32 non-null     int64
 3   disp     32 non-null     float64
 4   hp       32 non-null     int64
 5   drat     32 non-null     float64
 6   wt       32 non-null     float64
 7   qsec     32 non-null     float64
 8   vs       32 non-null     int64
 9   am       32 non-null     int64
 10  gear     32 non-null     int64
 11  carb     32 non-null     int64
dtypes: float64(5), int64(6), object(1)
memory usage: 3.1+ KB

In [93]:
infile.describe()

,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
count,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.0000
mean,20.090625,6.187500,230.721875,146.687500,3.596563,3.217250,17.848750,0.437500,0.406250,3.687500,2.8125
std,6.026948,1.785922,123.938694,68.562868,0.534679,0.978457,1.786943,0.504016,0.498991,0.737804,1.6152
min,10.400000,4.000000,71.100000,52.000000,2.760000,1.513000,14.500000,0.000000,0.000000,3.000000,1.0000
25%,15.425000,4.000000,120.825000,96.500000,3.080000,2.581250,16.892500,0.000000,0.000000,3.000000,2.0000
50%,19.200000,6.000000,196.300000,123.000000,3.695000,3.325000,17.710000,0.000000,0.000000,4.000000,2.0000
75%,22.800000,8.000000,326.000000,180.000000,3.920000,3.610000,18.900000,1.000000,1.000000,4.000000,4.0000
max,33.900000,8.000000,472.000000,335.000000,4.930000,5.424000,22.900000,1.000000,1.000000,5.000000,8.0000

In [ ]:
# infile.loc[ Row Selection ???, Col Selection ?? ]

In [110]:
collist = ['CarName','mpg','wt','am']
print( type(collist) , collist)
rowlist = [0,2,25]
print( type(rowlist) , rowlist)

<class 'list'> ['CarName', 'mpg', 'wt', 'am']
<class 'list'> [0, 2, 25]

In [103]:
# infile.loc [ : , : ]  - All Rows and all Columns
# infile.loc [ : , collist   ]   ### - Select only carname, mpg and wt columns and all rows
infile.loc [ rowlist , collist ] ### - Select carname, mpg and wt columns / rows 
                                 #     which has a name/index 0,2,25

       CarName   mpg     wt
0    Mazda RX4  21.0  2.620
2   Datsun 710  22.8  2.320
25   Fiat X1-9  27.3  1.935

In [115]:
infile.loc [ infile['CarName'].str.startswith('Merc') , collist ]
infile.loc [ infile['am']==0 , collist ]

infile.loc [ infile['mpg'] > 25 , collist ]
#### mpg > 25

           CarName   mpg     wt  am
17        Fiat 128  32.4  2.200   1
18     Honda Civic  30.4  1.615   1
19  Toyota Corolla  33.9  1.835   1
25       Fiat X1-9  27.3  1.935   1
26   Porsche 914-2  26.0  2.140   1
27    Lotus Europa  30.4  1.513   1

In [123]:
### mpg > 25 and wt < 2 tonnes

infile.loc[ (infile['mpg'] > 25) & (infile['wt'] < 2 )   , collist ]

           CarName   mpg     wt  am
18     Honda Civic  30.4  1.615   1
19  Toyota Corolla  33.9  1.835   1
25       Fiat X1-9  27.3  1.935   1
27    Lotus Europa  30.4  1.513   1

In [ ]:
# How many automatic and manual cars are there in the data?
# Vulnerable - SQL Inj, Security ,Excesses, ...)

In [124]:
infile['am'].value_counts() ### select count(cars) from infile group by am

0    19
1    13
Name: am, dtype: int64

In [126]:
infile['cyl'].value_counts() ### select count(cars) from infile group by cyl

8    14
4    11
6     7
Name: cyl, dtype: int64

In [132]:
# How many cars are automatic and 4 cylinders - RATHER give me all combinations of cyl and am
### Crosstab is a generic function (need not be part of the OBJECT like infile.value_counts()
pd.crosstab( infile['am'] , infile['cyl'] , margins=True )

cyl   4  6   8  All
am
0     3  4  12   19
1     8  3   2   13
All  11  7  14   32

In [131]:
sqlfile = pd.read_csv('sql.csv')
pd.crosstab(sqlfile['Type'],sqlfile['Region'],margins=True)

Region    East  North  South  West  All
Type
Excesses     3      4      3     3   13
SQL          1      0      3     1    5
All          4      4      6     4   18

In [146]:
infile.pivot_table(index=['cyl'], columns= ['am'] , values=['mpg'] , aggfunc=['max'], 
                   margins=True)

      max
      mpg
am      0     1   All
cyl
4    24.4  33.9  33.9
6    21.4  21.0  21.4
8    19.2  15.8  19.2
All  24.4  33.9  33.9

In [150]:
outdf = infile.loc[ [0,2,10] , collist]
outdf.to_csv('outputmtcars.csv')

       CarName   mpg    wt  am
0    Mazda RX4  21.0  2.62   1
2   Datsun 710  22.8  2.32   1
10   Merc 280C  17.8  3.44   0

In [ ]:
for i in inputfile: (100)
    roces
    
    proces dsfdsv
    sdfsdfsdf
    sdfsdfsdf
    if (condition) <-- 20
       continue
    write to another file

In [163]:
f = open('mtcars.csv','r')
data = f.read()
f.close()

In [166]:
datalist = data.split('\n')
#print("Before deleting")
#print(datalist)
outdatalist = []

for j in datalist:
    if (j.startswith('Mazda')):
        continue
    else:
        outdatalist.append(j)
        
print(outdatalist)

['CarName,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb', 'Datsun 710,22.8,4,108,93,3.85,2.32,18.61,1,1,4,1', 'Hornet 4 Drive,21.4,6,258,110,3.08,3.215,19.44,1,0,3,1', 'Hornet Sportabout,18.7,8,360,175,3.15,3.44,17.02,0,0,3,2', 'Valiant,18.1,6,225,105,2.76,3.46,20.22,1,0,3,1', 'Duster 360,14.3,8,360,245,3.21,3.57,15.84,0,0,3,4', 'Merc 240D,24.4,4,146.7,62,3.69,3.19,20,1,0,4,2', 'Merc 230,22.8,4,140.8,95,3.92,3.15,22.9,1,0,4,2', 'Merc 280,19.2,6,167.6,123,3.92,3.44,18.3,1,0,4,4', 'Merc 280C,17.8,6,167.6,123,3.92,3.44,18.9,1,0,4,4', 'Merc 450SE,16.4,8,275.8,180,3.07,4.07,17.4,0,0,3,3', 'Merc 450SL,17.3,8,275.8,180,3.07,3.73,17.6,0,0,3,3', 'Merc 450SLC,15.2,8,275.8,180,3.07,3.78,18,0,0,3,3', 'Cadillac Fleetwood,10.4,8,472,205,2.93,5.25,17.98,0,0,3,4', 'Lincoln Continental,10.4,8,460,215,3,5.424,17.82,0,0,3,4', 'Chrysler Imperial,14.7,8,440,230,3.23,5.345,17.42,0,0,3,4', 'Fiat 128,32.4,4,78.7,66,4.08,2.2,19.47,1,1,4,1', 'Honda Civic,30.4,4,75.7,52,4.93,1.615,18.52,1,1,4,2', 'Toyota Corolla,33.9,4,71.1,65,4.22,1.835,19.9,1,1,4,1', 'Toyota Corona,21.5,4,120.1,97,3.7,2.465,20.01,1,0,3,1', 'Dodge Challenger,15.5,8,318,150,2.76,3.52,16.87,0,0,3,2', 'AMC Javelin,15.2,8,304,150,3.15,3.435,17.3,0,0,3,2', 'Camaro Z28,13.3,8,350,245,3.73,3.84,15.41,0,0,3,4', 'Pontiac Firebird,19.2,8,400,175,3.08,3.845,17.05,0,0,3,2', 'Fiat X1-9,27.3,4,79,66,4.08,1.935,18.9,1,1,4,1', 'Porsche 914-2,26,4,120.3,91,4.43,2.14,16.7,0,1,5,2', 'Lotus Europa,30.4,4,95.1,113,3.77,1.513,16.9,1,1,5,2', 'Ford Pantera L,15.8,8,351,264,4.22,3.17,14.5,0,1,5,4', 'Ferrari Dino,19.7,6,145,175,3.62,2.77,15.5,0,1,5,6', 'Maserati Bora,15,8,301,335,3.54,3.57,14.6,0,1,5,8', 'Volvo 142E,21.4,4,121,109,4.11,2.78,18.6,1,1,4,2', '']